{
  "enchantment.terramity.bottomless_magazine.desc": "Increases maximum gun ammo, the amount varies between guns.",
  "enchantment.terramity.curse_of_misfiring.desc": "Doubles recoil of any gun.",
  "enchantment.terramity.gentle_explosives.desc": "Makes rocket launcher-type weapons not destroy blocks.",
  "enchantment.terramity.leadfoot.desc": "Removes recoil of any gun.",
  "enchantment.terramity.lucky_blanks.desc": "Adds the ability to save on ammo on reload.",
  "enchantment.terramity.narrowed_pellets.desc": "Reduces the spread of shotguns. Incompatible with Slug Conversion.",
  "enchantment.terramity.overclocked.desc": "Reduces wind-up speed on railgun-type weapons.",
  "enchantment.terramity.quicker_cooling.desc": "Reduces cooldown on railgun-type weapons by 12% per level.",
  "enchantment.terramity.rapid_reload.desc": "Increases reload speed. Incompatible with Semi-Auto.",
  "enchantment.terramity.semi_auto.desc": "Turns automatic weapons, pump-action shotguns and bolt-action sniper rifles into semi-automatic. Incompatible with Rapid Reload.",
  "enchantment.terramity.sharper_rounds.desc": "Increases bullet damage by 6.66% per level.",
  "enchantment.terramity.slug_conversion.desc": "Makes shotgun fire a single high-damage shot instead of pellet spread. Incompatible with Narrowed Pellets.",
  "effect.terramity.amped.description": "This effect increases all damage dealt by 1.5x.",
  "effect.terramity.divergency.description": "This effect makes any damage dealt hit twice, over a short delay. The second hit's damage is capped at 20.",
  "effect.terramity.dizzy.description": "This effect makes you really dizzy!",
  "effect.terramity.vulnerable.description": "This effect increases all damage taken by 1.33x.",
  "effect.terramity.shadowstep.description": "This effect places invisible blocks beneath your feet, letting you walk mid-air.",
  "effect.terramity.nyxium_fire.description": "This effect heavily damages you over time, similar to being on fire. However, fire resistance and water do not affect it!",
  "effect.terramity.resourceful_rounds.description": "This effect adds the ability to save on ammo when you reload. Each effect level adds an additional 10% chance, starting at 10%.",
  "effect.terramity.hexed.description": "When this effect ends, it halves your health. Does nothing until it ends or reapplies. Deals 20 damage to non-player entities.",
  "effect.terramity.phasing.description": "This effect makes you invulnerable to all damage.",
  "effect.terramity.lifesteal.description": "This effect heals you for a portion of the damage dealt. Healing is capped at one heart per hit.",
  "effect.terramity.mortal_flight.description": "Grants temporary elytra flight without the need of elytra! Though like with elytra, firework rockets won't work.",
  "effect.terramity.misprogrammed.description": "On hit, this effect rids the entity of invulnerability frames!",
  "effect.terramity.divine_flight.description": "Grants temporary creative flight in survival mode!",
  "effect.terramity.mirroring.description": "This effect causes half of any damage dealt to be reflected back at you.",
  "effect.terramity.immunity.description": "This effect makes you immune to all negative effects.",
  "effect.terramity.electric_shock_effect.description": "This effect causes you to shake violently and deals damage over time.",
  "effect.terramity.dripleaf_step.description": "This effect places dripleaf blocks beneath your feet, letting you walk mid-air.",
  "effect.terramity.flipped_gravity.description": "This effect flips gravity upside-down for you!"
}
